### Pandas:
pandas is a library for data analysis such as reading,process,analyse and visualize the data 

pandas can be declare in two types:
* series
* DataFrame

Series is a pandas package for display data in one dimensional array



DataFrame is a pandas package for display the data in two dimensional array

In [1]:
# instal pandas
# pip install pandas

In [3]:
import pandas as pd
s=pd.Series([10,20,30,40])    # in o/p it gives values with index also
s

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
s=pd.Series([12.4,5.6,10,12,90])  # if we give float and int it gives float values as o/p

In [5]:
s

0    12.4
1     5.6
2    10.0
3    12.0
4    90.0
dtype: float64

In [6]:
s=pd.Series(['okasring',12.4,2,90,50,44])   # if we give string  with int and float its returns dtype:object
s

0    okasring
1        12.4
2           2
3          90
4          50
5          44
dtype: object

In [7]:
s=pd.Series([10,20,30],[12,13,14])  # it takes one as o/p and one as index
s

12    10
13    20
14    30
dtype: int64

In [8]:
s=pd.Series([[1,2,3],[4,5,6]])

In [9]:
s

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [10]:
s={1,2,3,4}          # Error //set is unorderd
a=pd.Series(s)
a

TypeError: 'set' type is unordered

# DataFrame:

In [11]:
l=[10,20,30,40]         # it gives index also
df=pd.DataFrame(l)      # 1d array  //list in 1d array
df

    0
0  10
1  20
2  30
3  40

In [13]:
l=[[10,20],[30,40],[50,60]]         # list of list
df=pd.DataFrame(l)                   # list in 2d array
df

    0   1
0  10  20
1  30  40
2  50  60

In [14]:
l=[("mercy",90),("jerusha",97),("tinsey",98),("Prinsey",99)]
df=pd.DataFrame(l)  # list of tuples
df                                   # list in tuples

         0   1
0    mercy  90
1  jerusha  97
2   tinsey  98
3  Prinsey  99

In [ ]:
# numpy array into DataFrame

In [17]:
import numpy as np    
a=np.array([1,10])
df=pd.DataFrame(a)
df

    0
0   1
1  10

In [18]:
import numpy as np
a=np.arange(8).reshape(4,2)
df=pd.DataFrame(a)
df

   0  1
0  0  1
1  2  3
2  4  5
3  6  7

In [ ]:
# changing columns names

In [20]:
l=[('sunny',30),('snowfall',20),('rainy',44)]
df=pd.DataFrame(l,columns=["Weather Name","degree"])
df

  Weather Name  degree
0        sunny      30
1     snowfall      20
2        rainy      44

In [21]:
l=[('sunny',30),('snowfall',20),('rainy',44)]
df=pd.DataFrame(l)
df.columns=["Weather Name","degree"]
df

  Weather Name  degree
0        sunny      30
1     snowfall      20
2        rainy      44

In [1]:
import pandas as pd
l=[]
for i in range(5):
    n=input("enter your name")
    l.append(n)
df=pd.DataFrame(l,columns=['Name'])
df

enter your namemercy
enter your namejerusha
enter your name
enter your nametinsey
enter your nameprinsey

      Name
0    mercy
1  jerusha
2
3   tinsey
4  prinsey

In [2]:
d={'name':['a','b','c','d','e'],'age':[10,15,20,40,50],'marks':[100,99,98,94,100]}
df=pd.DataFrame(d)           # list in DataFrame
df

  name  age  marks
0    a   10    100
1    b   15     99
2    c   20     98
3    d   40     94
4    e   50    100

In [3]:
df['name']            # o/p is in series

0    a
1    b
2    c
3    d
4    e
Name: name, dtype: object

In [4]:
df[['name']]           # o/p is in dataframe we use double braces//list within another list

  name
0    a
1    b
2    c
3    d
4    e

In [7]:
df[['age','marks']]       # accessing columns

   age  marks
0   10    100
1   15     99
2   20     98
3   40     94
4   50    100

In [9]:
df[:]                 # accessing rows

  name  age  marks
0    a   10    100
1    b   15     99
2    c   20     98
3    d   40     94
4    e   50    100

In [10]:
df[0:3]

  name  age  marks
0    a   10    100
1    b   15     99
2    c   20     98

In [11]:
df[4:]

  name  age  marks
4    e   50    100

### iloc and loc

* loc means location of index   # we should call char,number

* iloc means index location      #we should call index values

In [74]:
d={'sno':[101,102,103,104,105],'sname':['a','b','c','d','e'],'marks':[98,99,100,94,92]}
df=pd.DataFrame(d)
df

   sno sname  marks
0  101     a     98
1  102     b     99
2  103     c    100
3  104     d     94
4  105     e     92

In [75]:
df.set_index('sno')          #sno sets as index

    sname  marks
sno
101     a     98
102     b     99
103     c    100
104     d     94
105     e     92

In [76]:
df

   sno sname  marks
0  101     a     98
1  102     b     99
2  103     c    100
3  104     d     94
4  105     e     92

In [77]:
# the df is not updates to update it we have two methods
#1.df=df.set_index('sno')
#2.df.reset_index(inplace=True)//inplace=True

In [78]:
df=df.set_index('sno')
df

    sname  marks
sno
101     a     98
102     b     99
103     c    100
104     d     94
105     e     92

In [79]:
df.iloc[0:3,0:]

    sname  marks
sno
101     a     98
102     b     99
103     c    100

In [80]:
df.loc[104:]

    sname  marks
sno
104     d     94
105     e     92

In [81]:
df.loc[103:105]

    sname  marks
sno
103     c    100
104     d     94
105     e     92

In [82]:
df.loc[101:,"sname":]

    sname  marks
sno
101     a     98
102     b     99
103     c    100
104     d     94
105     e     92

In [83]:
df.reset_index(inplace=True)

In [84]:
df

   sno sname  marks
0  101     a     98
1  102     b     99
2  103     c    100
3  104     d     94
4  105     e     92

In [85]:
#change columns name

In [86]:
df.columns=['student number','student name','student marks']

In [87]:
df

   student number student name  student marks
0             101            a             98
1             102            b             99
2             103            c            100
3             104            d             94
4             105            e             92

In [88]:
# delete columns

In [89]:
df.drop('student marks',axis=1)

   student number student name
0             101            a
1             102            b
2             103            c
3             104            d
4             105            e

In [90]:
df.drop(4)                      # dont write marks column

   student number student name  student marks
0             101            a             98
1             102            b             99
2             103            c            100
3             104            d             94

In [116]:
d={'sno':[101,102,103,104,105],'sname':['a','b','c','d','e'],'marks':[98,99,100,94,92]}
df=pd.DataFrame(d)
df

   sno sname  marks
0  101     a     98
1  102     b     99
2  103     c    100
3  104     d     94
4  105     e     92

In [117]:
# condition based access data
df['marks']>80

0    True
1    True
2    True
3    True
4    True
Name: marks, dtype: bool

In [118]:
df[df['marks']>=92]

   sno sname  marks
0  101     a     98
1  102     b     99
2  103     c    100
3  104     d     94
4  105     e     92

In [119]:
df[df['sname']=='a']

   sno sname  marks
0  101     a     98

In [120]:
df[(df['marks']>=80)& (df['sname']=='a')]

   sno sname  marks
0  101     a     98

In [121]:
df

   sno sname  marks
0  101     a     98
1  102     b     99
2  103     c    100
3  104     d     94
4  105     e     92

In [122]:
# add a new column
df['average']=df['marks']/100

In [123]:
df

   sno sname  marks  average
0  101     a     98     0.98
1  102     b     99     0.99
2  103     c    100     1.00
3  104     d     94     0.94
4  105     e     92     0.92

In [124]:
d={'sno':106,'sname':'f','marks':88,'average':90}
df=df.append(d,ignore_index=True)
df

   sno sname  marks  average
0  101     a     98     0.98
1  102     b     99     0.99
2  103     c    100     1.00
3  104     d     94     0.94
4  105     e     92     0.92
5  106     f     88    90.00

# File  into DataFrame:

* .csv=> pd.read_csv("filename.csv")
* .excel=>pd.read_excel("filename.xlsx")
* .json=>pd.read_json("filename.json")
* .html=>pd.read_html("url")

In [134]:
df=pd.read_csv('Automobile_data (5).csv')
df.head()

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450